tf-controller plan output:

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.autodiscover["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "autodiscover" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 autodiscover.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_autodiscover"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "ec150de5a7096b07398f45e41e0e709d"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_autodiscover._tcp.bbck.dev" -> "_autodiscover._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.autodiscover["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "autodiscover" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 autodiscover.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:28:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_autodiscover"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "b8fd0c2863005ed54776b711bd396d05"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:28:11Z" -> (known after apply)
      ~ name                = "_autodiscover._tcp.bbck.net" -> "_autodiscover._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.autodiscover["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "autodiscover" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 autodiscover.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_autodiscover"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "80f821ecc2c1e0fc0083c4adc10e0d80"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_autodiscover._tcp.cheatycheetahs.com" -> "_autodiscover._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky will be updated in-place
  ~ resource "cloudflare_dns_record" "bluesky" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-28T05:23:34Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "438d692267bc466db0a519268669fc56"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "_atproto.bbck.net" -> "_atproto"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldav["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "81f4ac635826c9a23b1474cdf7d08303"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_caldav._tcp.bbck.dev" -> "_caldav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldav["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "afde9c7fb6d115986b8c7ca7af63287e"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_caldav._tcp.bbck.net" -> "_caldav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldav["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "268ffb79771b0e014eee3abb251b72e3"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_caldav._tcp.cheatycheetahs.com" -> "_caldav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldavs["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 caldav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "67e6698512723f189006e3a2f01d8e52"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_caldavs._tcp.bbck.dev" -> "_caldavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldavs["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 caldav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "a73a5909a650891e30a142a26dee07df"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_caldavs._tcp.bbck.net" -> "_caldavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.caldavs["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "caldavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 caldav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_caldavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "9e94f8120725c93ced2ca27c376c8b44"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_caldavs._tcp.cheatycheetahs.com" -> "_caldavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddav["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "f0f8bea05859b4b5a274563e8b6a9fdf"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_carddav._tcp.bbck.dev" -> "_carddav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddav["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "aa7cc2f8aef68d000d50015ef6372b18"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_carddav._tcp.bbck.net" -> "_carddav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddav["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddav" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddav"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "e15b739e206e7ad68190433d8eeea92a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_carddav._tcp.cheatycheetahs.com" -> "_carddav._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddavs["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 carddav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "fcd85d77615cf0b68a19b8846783a664"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_carddavs._tcp.bbck.dev" -> "_carddavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddavs["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 carddav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "a26d9ee36a305acf17460de1065b3281"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_carddavs._tcp.bbck.net" -> "_carddavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.carddavs["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "carddavs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 carddav.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_carddavs"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "0ef8c4dbefb3a9bcbbe7be819df46b74"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_carddavs._tcp.cheatycheetahs.com" -> "_carddavs._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.disable_email_spf["lookitupongoogle.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "disable_email_spf" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-25T05:23:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "25d8065ad74cc333d8f13fde87499daf"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-25T05:26:01Z" -> (known after apply)
      ~ name                = "lookitupongoogle.com" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_1["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_1" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "fd28f545759e7abcc1e11518a4cc59ae"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "fm1._domainkey.bbck.dev" -> "fm1._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_1["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_1" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:46Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "fe0f711434f9cfd9d4307813f1cd5700"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:46Z" -> (known after apply)
      ~ name                = "fm1._domainkey.bbck.net" -> "fm1._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_1["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_1" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "29d1502d877eafa3c5460ff6412fec64"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "fm1._domainkey.cheatycheetahs.com" -> "fm1._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_2["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_2" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "281ff672426ba94973f6b441cc5d2536"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "fm2._domainkey.bbck.dev" -> "fm2._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_2["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_2" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:46Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "e61a140aed627ecb400877d395c19027"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:46Z" -> (known after apply)
      ~ name                = "fm2._domainkey.bbck.net" -> "fm2._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_2["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_2" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "a3085b1e99227c5d9ebd919b94a1077d"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "fm2._domainkey.cheatycheetahs.com" -> "fm2._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_3["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "02c09f263234c7d4e81e6a0c4ad3ba85"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "fm3._domainkey.bbck.dev" -> "fm3._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_3["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:45Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "aecf75f9f4aacc0922e4a5f1447e3e5a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "fm3._domainkey.bbck.net" -> "fm3._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim_3["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim_3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "ec358e34ba631f9b42a8a919a367152d"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "fm3._domainkey.cheatycheetahs.com" -> "fm3._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dmarc["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:21:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "fddfe93662b45149f43bb90425fdccdd"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:31:59Z" -> (known after apply)
      ~ name                = "_dmarc.bbck.dev" -> "_dmarc"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dmarc["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:45Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "4cc65f0cb8ea99d365123eb00f88b035"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "_dmarc.bbck.net" -> "_dmarc"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dmarc["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "c95f2a3052f58ffdda21380802c39cbe"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:31:59Z" -> (known after apply)
      ~ name                = "_dmarc.cheatycheetahs.com" -> "_dmarc"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imap["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "ef2129172d0d169bcc2706594043791c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_imap._tcp.bbck.dev" -> "_imap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imap["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "b50ff7bd0f3236d6c946468af2c3e9a4"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_imap._tcp.bbck.net" -> "_imap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imap["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "0acb5c1eeaa342178ed877e162e929f8"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_imap._tcp.cheatycheetahs.com" -> "_imap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imaps["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imaps" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 993 imap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imaps"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "1ae5e81d29e8ec65a1c2f494db29db84"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_imaps._tcp.bbck.dev" -> "_imaps._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imaps["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imaps" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 993 imap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imaps"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "42133ef2e56b2ca7d2adbc0e03352377"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_imaps._tcp.bbck.net" -> "_imaps._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.imaps["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "imaps" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 993 imap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_imaps"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "d5f6b011d0df39b4962cc3f031e9ad37"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_imaps._tcp.cheatycheetahs.com" -> "_imaps._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.jmap["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "jmap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 jmap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_jmap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "1f194fd7007c51b9fbc858fcae0e52c9"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_jmap._tcp.bbck.dev" -> "_jmap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.jmap["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "jmap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 jmap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_jmap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "c37de9ec89402f9581a34955537e1acc"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_jmap._tcp.bbck.net" -> "_jmap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.jmap["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "jmap" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 jmap.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_jmap"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "02cba4834d622ed49f9287915785be5f"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_jmap._tcp.cheatycheetahs.com" -> "_jmap._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.keybase will be updated in-place
  ~ resource "cloudflare_dns_record" "keybase" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-28T05:13:44Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "ff3f5d8dcbbb9abf241c5b0f9382424c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "bbck.net" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mesmtp["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mesmtp" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "766cd2614f7dd8941fea51a7ed730683"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "mesmtp._domainkey.bbck.dev" -> "mesmtp._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mesmtp["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mesmtp" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:45Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "7cefd607a3ce814f6e80658cdaa40a90"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "mesmtp._domainkey.bbck.net" -> "mesmtp._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mesmtp["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mesmtp" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "466ae109e6aa78d9dec09eb7dd6371f1"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "mesmtp._domainkey.cheatycheetahs.com" -> "mesmtp._domainkey"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mta_sts["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mta_sts" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:21:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "3add237c7000d744373fbf86c6bfb092"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:21:16Z" -> (known after apply)
      ~ name                = "_mta-sts.bbck.dev" -> "_mta-sts"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mta_sts["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mta_sts" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:46Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "fd26b21d96df09f088c7f546507c0c4b"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:46Z" -> (known after apply)
      ~ name                = "_mta-sts.bbck.net" -> "_mta-sts"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mta_sts["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mta_sts" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "ff25bff687c7a8f89336a16bbec77f9c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_mta-sts.cheatycheetahs.com" -> "_mta-sts"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_10["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_10" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "beb5097c4e44db5d50c748ab28e81249"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "bbck.dev" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_10["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_10" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "9c7fcb2e630edea1316211538b767557"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "bbck.net" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_10["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_10" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "690b35bd2390dd6c3a7816308afc585b"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "cheatycheetahs.com" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_20["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_20" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "7305b5d9ef10d8760ba5eeaf3c328cd6"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "bbck.dev" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_20["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_20" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "952d688e37d664f7ab788488b041c2f7"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "bbck.net" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mx_20["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "mx_20" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "a9925f4d8cf9324a94b149c99dfcfa9a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "cheatycheetahs.com" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "48e5e75290cf7090822772eb50ef58c4"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_pop3._tcp.bbck.dev" -> "_pop3._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "2ec5ee34699705499e73a35161a67579"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_pop3._tcp.bbck.net" -> "_pop3._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "b41ca06787ced5cf92f60a7ff8bdacbf"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_pop3._tcp.cheatycheetahs.com" -> "_pop3._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3s["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3s" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 995 pop.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3s"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "f1b289b472c16f1506e56730cb59a57c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_pop3s._tcp.bbck.dev" -> "_pop3s._tcp"
      - priority            = 10 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3s["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3s" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 995 pop.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3s"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "1a05ebc743bf2779fbe65f29f86ad9a4"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ name                = "_pop3s._tcp.bbck.net" -> "_pop3s._tcp"
      - priority            = 10 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.pop3s["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "pop3s" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 995 pop.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_pop3s"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "0363f4a5db58c23e550f28f66bdc60c8"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_pop3s._tcp.cheatycheetahs.com" -> "_pop3s._tcp"
      - priority            = 10 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.smtp_tls_reporting["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "smtp_tls_reporting" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:21:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "e4d7e576f0690bdd1262a03808601fda"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:31:59Z" -> (known after apply)
      ~ name                = "_smtp._tls.bbck.dev" -> "_smtp._tls"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.smtp_tls_reporting["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "smtp_tls_reporting" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T03:56:46Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "aa6d2ba15c31f155b97a2bb2b0a57222"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:46Z" -> (known after apply)
      ~ name                = "_smtp._tls.bbck.net" -> "_smtp._tls"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.smtp_tls_reporting["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "smtp_tls_reporting" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "7a3dc05b4b8487eff2d1cae5ac9f3ac5"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:31:59Z" -> (known after apply)
      ~ name                = "_smtp._tls.cheatycheetahs.com" -> "_smtp._tls"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spf["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "spf" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "33524b736de064ffb67fea2de88a7cb3"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "bbck.dev" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spf["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "spf" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2023-01-11T06:55:14Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "9994ef8eb472f01a5fee2a2f5941fbdf"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T03:56:45Z" -> (known after apply)
      ~ name                = "bbck.net" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spf["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "spf" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "7d078caf036eeb70cf8af64590a8e47a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "cheatycheetahs.com" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submission["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submission" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submission"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "9d370d9be550de5485f16aa0e6e5a80c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_submission._tcp.bbck.dev" -> "_submission._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submission["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submission" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-28T05:16:28Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submission"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "ef132c7340422c7f83873e2a8e1c52a2"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:28:11Z" -> (known after apply)
      ~ name                = "_submission._tcp.bbck.net" -> "_submission._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submission["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submission" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 0 ." -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submission"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "be4f02eeb201a04934ed69024c39c865"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_submission._tcp.cheatycheetahs.com" -> "_submission._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submissions["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submissions" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 465 smtp.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submissions"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "7fcf361ba16feb8cb7073aa8fa619a2f"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:12:38Z" -> (known after apply)
      ~ name                = "_submissions._tcp.bbck.dev" -> "_submissions._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submissions["bbck.net"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submissions" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 465 smtp.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-28T05:28:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submissions"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "cb3377185fb227b7ab5047d0d5e56c09"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-28T05:28:11Z" -> (known after apply)
      ~ name                = "_submissions._tcp.bbck.net" -> "_submissions._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.submissions["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "submissions" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 465 smtp.fastmail.com" -> (known after apply)
      ~ created_on          = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + service        = "_submissions"
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "80ac9975b2d23dec65079a0b2d2f304b"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-30T04:11:11Z" -> (known after apply)
      ~ name                = "_submissions._tcp.cheatycheetahs.com" -> "_submissions._tcp"
      - priority            = 0 -> null
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_r2_bucket.k8s_backups will be updated in-place
  ~ resource "cloudflare_r2_bucket" "k8s_backups" {
      ~ creation_date = "2024-06-25T05:32:16.497Z" -> (known after apply)
        id            = "k8s-backups"
      + jurisdiction  = "default"
      + location      = "wnam"
        name          = "k8s-backups"
      + storage_class = "Standard"
        # (1 unchanged attribute hidden)
    }

  # cloudflare_workers_script.lookitupongoogle will be updated in-place
  ~ resource "cloudflare_workers_script" "lookitupongoogle" {
      + bindings        = (known after apply)
      + content         = <<-EOT
            const base = 'https://www.google.com'
            const statusCode = 301
            
            async function handleRequest (request) {
              const url = new URL(request.url)
              const { pathname, search } = url
            
              const destinationURL = base + pathname + search
            
              return Response.redirect(destinationURL, statusCode)
            }
            
            addEventListener('fetch', async event => {
              event.respondWith(handleRequest(event.request))
            })
        EOT
      + created_on      = (known after apply)
      + etag            = (known after apply)
      + has_assets      = (known after apply)
      + has_modules     = (known after apply)
        id              = "lookitupongoogle"
      + logpush         = (known after apply)
      + migrations      = (known after apply)
      + modified_on     = (known after apply)
      + observability   = (known after apply)
      + placement       = (known after apply)
      + startup_time_ms = (known after apply)
      + tail_consumers  = (known after apply)
      + usage_model     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_workers_script.mta_sts["bbck.dev"] will be updated in-place
  ~ resource "cloudflare_workers_script" "mta_sts" {
      + bindings        = (known after apply)
      + content         = <<-EOT
            const policy = `version: STSv1
            mode: enforce
            mx: in1-smtp.messagingengine.com
            mx: in2-smtp.messagingengine.com
            max_age: 604800`
            
            async function handleRequest (request) {
              return new Response(policy, {
                headers: {
                  'content-type': 'text/plain;charset=UTF-8'
                }
              })
            }
            
            addEventListener('fetch', event => {
              return event.respondWith(handleRequest(event.request))
            })
        EOT
      + created_on      = (known after apply)
      + etag            = (known after apply)
      + has_assets      = (known after apply)
      + has_modules     = (known after apply)
        id              = "mta-sts-bbck-dev"
      + logpush         = (known after apply)
      + migrations      = (known after apply)
      + modified_on     = (known after apply)
      + observability   = (known after apply)
      + placement       = (known after apply)
      + startup_time_ms = (known after apply)
      + tail_consumers  = (known after apply)
      + usage_model     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_workers_script.mta_sts["bbck.net"] will be updated in-place
  ~ resource "cloudflare_workers_script" "mta_sts" {
      + bindings        = (known after apply)
      + content         = <<-EOT
            const policy = `version: STSv1
            mode: enforce
            mx: in1-smtp.messagingengine.com
            mx: in2-smtp.messagingengine.com
            max_age: 604800`
            
            async function handleRequest (request) {
              return new Response(policy, {
                headers: {
                  'content-type': 'text/plain;charset=UTF-8'
                }
              })
            }
            
            addEventListener('fetch', event => {
              return event.respondWith(handleRequest(event.request))
            })
        EOT
      + created_on      = (known after apply)
      + etag            = (known after apply)
      + has_assets      = (known after apply)
      + has_modules     = (known after apply)
        id              = "mta-sts-bbck-net"
      + logpush         = (known after apply)
      + migrations      = (known after apply)
      + modified_on     = (known after apply)
      + observability   = (known after apply)
      + placement       = (known after apply)
      + startup_time_ms = (known after apply)
      + tail_consumers  = (known after apply)
      + usage_model     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_workers_script.mta_sts["cheatycheetahs.com"] will be updated in-place
  ~ resource "cloudflare_workers_script" "mta_sts" {
      + bindings        = (known after apply)
      + content         = <<-EOT
            const policy = `version: STSv1
            mode: enforce
            mx: in1-smtp.messagingengine.com
            mx: in2-smtp.messagingengine.com
            max_age: 604800`
            
            async function handleRequest (request) {
              return new Response(policy, {
                headers: {
                  'content-type': 'text/plain;charset=UTF-8'
                }
              })
            }
            
            addEventListener('fetch', event => {
              return event.respondWith(handleRequest(event.request))
            })
        EOT
      + created_on      = (known after apply)
      + etag            = (known after apply)
      + has_assets      = (known after apply)
      + has_modules     = (known after apply)
        id              = "mta-sts-cheatycheetahs-com"
      + logpush         = (known after apply)
      + migrations      = (known after apply)
      + modified_on     = (known after apply)
      + observability   = (known after apply)
      + placement       = (known after apply)
      + startup_time_ms = (known after apply)
      + tail_consumers  = (known after apply)
      + usage_model     = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 74 to change, 0 to destroy.

```

To apply this plan, please **merge** this pull request.
